sort_index,sort_values, index.is_unique,reset_index, rank,sum, min, max, skipna, where, descripe

# Sorting and Ranking

In [1]:
import numpy as np
import pandas as pd

In [2]:
x1=np.arange(10).reshape(5,2)
df=pd.DataFrame(x1,columns=['A','B'],index=['e','b','c','d','a'])
x1=pd.Series(df['A'])
print(x1)

e    0
b    2
c    4
d    6
a    8
Name: A, dtype: int32

In [3]:
x1.sort_index()

a    8
b    2
c    4
d    6
e    0
Name: A, dtype: int32

In [4]:
print(x1)
x1.sort_index(inplace=True)
print(x1)

e    0
b    2
c    4
d    6
a    8
Name: A, dtype: int32
a    8
b    2
c    4
d    6
e    0
Name: A, dtype: int32

In [5]:
df = pd.DataFrame(np.arange(10, 20).reshape(5, 2), columns=['B', 'A'], index=['e', 'b', 'c', 'd', 'a'])
print(df)

df.sort_index(axis=1)

    B   A
e  10  11
b  12  13
c  14  15
d  16  17
a  18  19

    A   B
e  11  10
b  13  12
c  15  14
d  17  16
a  19  18

In [6]:
df.sort_index(axis=0)

    B   A
a  18  19
b  12  13
c  14  15
d  16  17
e  10  11

In [7]:
df.sort_index(axis=0).sort_index(axis=1)

    A   B
a  19  18
b  13  12
c  15  14
d  17  16
e  11  10

In [8]:
x1=df['A']
x1

e    11
b    13
c    15
d    17
a    19
Name: A, dtype: int32

## sorting values

In [9]:
x1=df['A']
x1.sort_values(axis=0)

e    11
b    13
c    15
d    17
a    19
Name: A, dtype: int32

In [10]:
df
df.sort_values(by='A')

    B   A
e  10  11
b  12  13
c  14  15
d  16  17
a  18  19

In [11]:
df.sort_values(by=['B','A'])

    B   A
e  10  11
b  12  13
c  14  15
d  16  17
a  18  19

In [12]:
df.index.is_unique

True

In [13]:
df1=pd.Series([1,2,3,4,5,6,7,8,9,10])
print (df1)
print (df1.rank())
print (df1.rank(ascending=False))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     7.0
7     8.0
8     9.0
9    10.0
dtype: float64
0    10.0
1     9.0
2     8.0
3     7.0
4     6.0
5     5.0
6     4.0
7     3.0
8     2.0
9     1.0
dtype: float64

In [14]:
import pandas as pd

# Create a list of lists containing the data from the image
data = [[0, 4, 40, 22],
        [1, 2, 30, 11],
        [2, 3, 10, 33],
        [3, 1, 20, 44]]

# Create a DataFrame with the data
df = pd.DataFrame(data, columns=['a', 'b', 'c','d'])

print(df.rank())
print(df.rank(axis=1))
print(df.rank(method='average'))

     a    b    c    d
0  1.0  4.0  4.0  2.0
1  2.0  2.0  3.0  1.0
2  3.0  3.0  1.0  3.0
3  4.0  1.0  2.0  4.0
     a    b    c    d
0  1.0  2.0  4.0  3.0
1  1.0  2.0  4.0  3.0
2  1.0  2.0  3.0  4.0
3  2.0  1.0  3.0  4.0
     a    b    c    d
0  1.0  4.0  4.0  2.0
1  2.0  2.0  3.0  1.0
2  3.0  3.0  1.0  3.0
3  4.0  1.0  2.0  4.0

In [15]:
print(df)
df.set_axis(['A', 'A', 'D', 'D'], axis=0)

   a  b   c   d
0  0  4  40  22
1  1  2  30  11
2  2  3  10  33
3  3  1  20  44

   a  b   c   d
A  0  4  40  22
A  1  2  30  11
D  2  3  10  33
D  3  1  20  44

In [16]:
df.reset_index(drop=True)

   a  b   c   d
0  0  4  40  22
1  1  2  30  11
2  2  3  10  33
3  3  1  20  44

In [17]:
df = pd.DataFrame(np.arange(600).reshape(200, 3), index=pd.Series(['a', 'a', 'b', 'c'] * 50))
df.reset_index(drop=True, inplace=True)
df.index = df.index + 1  # start index from 1
print(df)

       0    1    2
1      0    1    2
2      3    4    5
3      6    7    8
4      9   10   11
5     12   13   14
..   ...  ...  ...
196  585  586  587
197  588  589  590
198  591  592  593
199  594  595  596
200  597  598  599

[200 rows x 3 columns]

other way

In [18]:
df = pd.DataFrame(np.arange(600).reshape(200, 3), index=pd.Series(['a', 'a', 'b', 'c'] * 50))
df.reset_index(drop=True, inplace=True)
df.set_axis([i for i in range(1,len(df)+1)])

       0    1    2
1      0    1    2
2      3    4    5
3      6    7    8
4      9   10   11
5     12   13   14
..   ...  ...  ...
196  585  586  587
197  588  589  590
198  591  592  593
199  594  595  596
200  597  598  599

[200 rows x 3 columns]

In [19]:

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 16, 18],
    'City': ['New York', 'Los Angeles', 'Chicago']
}


df = pd.DataFrame(data)

print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   16  Los Angeles
2  Charlie   18      Chicago

In [20]:
df['Eligible']=np.where(df['Age']>=18,'Yes','No')
df

      Name  Age         City Eligible
0    Alice   25     New York      Yes
1      Bob   16  Los Angeles       No
2  Charlie   18      Chicago      Yes

In [21]:
df.describe()

             Age
count   3.000000
mean   19.666667
std     4.725816
min    16.000000
25%    17.000000
50%    18.000000
75%    21.500000
max    25.000000

In [22]:
df=pd.Series(['A','B','C','A','B','C','A','F','A','B','B','B','D','C','C'])
df.unique()

array(['A', 'B', 'C', 'F', 'D'], dtype=object)

In [23]:
df.value_counts()

B    5
A    4
C    4
F    1
D    1
Name: count, dtype: int64

In [24]:
df.value_counts(sort=False)

A    4
B    5
C    4
F    1
D    1
Name: count, dtype: int64

In [25]:
data = {
    'Winner': ['Ind', 'Pak', 'Eng', 'Westind', 'Sri', 'Westind', 'Aus', 'Eng', 'Ind'],
    'Runner up': ['Pak', 'Sri', 'Aus', 'Sri', 'Ind', 'Eng', 'New Zea', 'Pak', 'SA'],
    'Year': [2008, 2009, 2010, 2012, 2013, 2015, 2021, 2022, 2024]
}

df = pd.DataFrame(data)
df

    Winner Runner up  Year
0      Ind       Pak  2008
1      Pak       Sri  2009
2      Eng       Aus  2010
3  Westind       Sri  2012
4      Sri       Ind  2013
5  Westind       Eng  2015
6      Aus   New Zea  2021
7      Eng       Pak  2022
8      Ind        SA  2024

In [26]:
print(df['Winner'].unique())
print(pd.unique(df['Winner']))
print(df.Winner.unique())

['Ind' 'Pak' 'Eng' 'Westind' 'Sri' 'Aus']
['Ind' 'Pak' 'Eng' 'Westind' 'Sri' 'Aus']
['Ind' 'Pak' 'Eng' 'Westind' 'Sri' 'Aus']